package com.hrw.book.entity;

/**
 * @version 1.0.0
 * @author:hrw
 * @date:2018/11/08 14:29
 * @desc:
 */
public class BKChapterContentBO {

    /**
     * id : 343551
     * name : 盛唐幻夜
     * cid : 1819126
     * cname : 一 1 洛阳鬼市
     * pid : -1
     * nid : 1819127
     * content :
     　　那是盛唐年间，高宗与武后二圣治下，洛阳城西三十里。

     月上云端的光景，风波不起，飞鸟不走。运河泛着蓝影银光，在某一个关节走上岔路，流进大地裂开的缝隙里，水流被大大小小的岩石激荡，打了无数个漩涡，渐渐在黑色的砂石上搁浅。河道旁，峭壁上，山体不知被谁凿了无数个大小不一的洞室，白日里原本被木板封上，像一个个废弃的墓穴，可到了这个时辰，那些木板被卸掉了，红亮的灯光一重重地亮了起来，每一处灯光下都有个精彩的买卖，老板或是个神通广大的走私犯，或是个投机倒把的机灵鬼，或是个挖坟盗墓的缺德兽，兜售着好些个洛阳城里，日头底下看都看不见的好玩意：晶光闪耀的地府珠宝呀，奇香扑鼻的海外仙草呀，听说念了咒就能召唤恶灵听你差遣的法器，还有人弄来过脖子好高的鹿和鼻子老长个头好大的猪等等活物，刁钻古怪，不一而足。

     时辰到了，店铺打开，客人们渐多以至摩肩接踵，街面上有蒙面的美女反弹琵琶在唱歌儿卖艺，还有贩子现场宰杀了牛羊用柳木炙熟了吃，有人踩到了水果皮脚下发滑倒在地上，手里的酒坛子碎了，满街都是又香又冲的味道，他叫骂起来，还有人笑话他……人声渐响，越来越吵，越来越热闹……

     这里是洛阳城外的鬼市。

     他们的故事开始的地方。

     这时候的他

     没有名字，也没有什么样子，被关在一个还没有两尺高的铁笼子里，笼子原本装了几只狗，驯服的狗可会看家护院，在上一个市镇被贩子卖掉了，独独就把他剩下了，而此时他也看不出来什么人模样：瘦骨嶙峋，浑身漆黑，双目紧闭，缩着肩膀团着腿，蜷缩成一小团，静静地窝在笼子的角落里，像一块刚刚出土的黑炭，跟所有人所有的热闹无关。

     男孩此时的主人是那个从南边回来的人贩子。常来鬼市转悠的人们都认得这个家伙，他说自己绿色的络腮胡子是用传说中麒麟的血染成的，曾在爪哇岛布下天罗地网，守了十天十夜，熬到眼睛冒血的时候，终于捕到了长着翅膀的鸟人，被他献给了天竺的皇帝当做宠物，赚到了好几桶黄金。他也曾在漩涡丛生的大洋里掷下带着毒汁的鱼枪，冒死搏斗终于拽起来人身鱼尾的鲛人，把它献给了大唐的巨富当做奴隶，离开水的鲛人不久之后就干死了，但是他赚的钱却实实在在地落在口袋里，继而在赌桌上被他肆意挥霍。

     人贩子今天弄到的货色是三个肤色棕黑的女奴，他吆喝着把三个女奴拽到三尺方圆的石墩上，一个个地薅起来她们的头发让下面围着的主顾们看，又扒开女奴的嘴巴，展示她们的牙齿，人贩子吆喝着，声音响亮：“头发是血，牙齿是骨头，你们见过这么厚实的头发，这么整

     齐白亮的牙齿吗？这是体格最好的奴隶！筋骨结实，不会生病，农田上面的，家院里面的，什么活计都能干！买回去吧！绝不后悔！”

     一个女奴低下头去，人贩子窜过去，薅着头发，捏着下巴，转着她的脑袋让每一个位置上的主顾们都看见：“别看皮肤黑，可您瞧她这模样大眼睛翘鼻子的也不错吧？怪俊俏的是不是？买回去让她生个娃娃吧！”

     有人在下面起哄：“被你这一路带过来，肚子里面只怕已经有了你的娃娃了吧？！”

     人贩子闻言不恼，反而大笑，忽地一下就把女奴的袍子掀开，露出了肚皮，大片刀立着刀刃贴在女奴的肚子上：“切开让各位看看……”

     看热闹的那人还不嫌事儿大，在下面喊：“哎吆你还真敢？！好不容易倒弄来的货，你还真敢下手把她肚子开了？”

     绿胡子的人贩子阴阴一笑：“哼你这厮不用激我，咱们二人打个赌，我这就把这女人破了膛，若是里面没有娃娃，你付我双倍的钱，若是里面有娃娃，就当我今晚上给鬼市添个热闹！鬼市鬼市，反正也是无法无天！”

     围观的众人“哄”地一声，语言不通的女奴仿佛预感到了自己命如草芥，就要被凶残的人贩子当众开膛破肚，一大滴眼泪落了下来，人贩子反而被助了兴，当即就要按下大刀，直切入女奴的皮肉——！

     围观的人有胆子大的瞪圆了眼睛看，有

     胆子小的蒙上了眼睛，以为就要听到女奴的惨叫，谁知却是那绿胡子的人贩子“啊！”的一声，同时大刀落在地上，一屁股坐下——他不知被谁用暗器打穿了手背，留了个血洞在上面，鲜血直流！

     “谁？！谁暗算你爷爷我？！”

     没人应声。

     “明人不做暗事，谁用暗器伤我？有种上来，咱们比试比试，明着来，爷爷我不怕你！”

     还是没人应声。

     人贩子气得哇哇乱叫，围观的众人却开心了，议论纷纷：“瞧这大绿胡子嚣张的样子，早该被人收拾……对呀，刚才不是说要给鬼市添个热闹吗？这回他自己添上了吧……哎我说，大胡子，别逞威风了，这回被人在手上凿了个洞，小心等会儿被人在头上打个洞……哈哈哈哈……”

     大胡子的怪叫声，众人的嬉笑声让鬼市的这个角落瞬间极为鼓噪，笼子里的男孩原本蜷身昏睡着，此时被吵醒了，慢慢睁开眼睛，抱在胸前的双手略略伸展，向外看看，忽然就被吓了一跳，笼子外面竟有张脸，圆圆睁着双好眼正看着自己。

     跟他那一脸一身黑乎乎不同，夜光里也看得出来这人的颜色长得有多好。他皮肤粉白，双颊酡红，眉毛鬓角黑翠翠地，扎着个少年人用的金色小袱头，闪得他眼睛直酸。这人鼻子直溜溜，嘴巴厚嘟嘟，像着急忙慌地刚吃了一碗热汤面把自己嘴巴烫着了一样，嘴唇红得要命，他

     身上穿件浅黄色的小袍子，更衬得脖子手背那些露出来的皮肉粉白粉白。男孩听人贩子卖人的时候说过些七七八八的话，凡是颜色好的人，一定是吃得好，身体壮，男孩想这个看着他的家伙一定是吃得好，否则哪能长得出这么新鲜分明的色儿？

     笼子里的男孩就这么看着笼子外面的少年人，对方也就这么把他看了个仔细，忽然就咯地一乐，跟身边的人说：“哎呀原来是个人！真是个人！我当是个扣着的乌龟呢！”

     他同伴个子好高，男孩仰头也看不见他的脸，只见那脚上的一双白底靴，鬼市本来就是石子水路，人人脚下都沾泥带水，可不知道这位从哪里来，抄了什么近道儿，那靴子的白底竟一点泥渍水痕都没有。他没回答那个意兴盎然的少年人，只是低声地说：“走吧。还想再惹什么热闹？”

     少年人略不甘心，要起身离开，笼子里面的男孩忽然伸手拽住了他的手，竟是不肯让他走的样子，少年人颇为讶异，便将那只手臂伸进笼子里来任凭他抓住，想要看他究竟怎样，笼子里的男孩的手沿着他手臂向上而去，在他肩膀上轻轻地捉住了一只不知何时落上去的蓝色的蝴蝶，手掌再伸开，蝴蝶飞走了。

     少年人笑起来：“哟，这小孩有点意思……既是装在笼子里的，也是要卖的吧？不如我就把他买回家去……”

     他同伴是不想让他自在

     的，抢白道：“正事儿不干了？我带你来可是真的来这里逛街的？”

     少年人道你说的可也是，拍拍手便起身走了，仍是回头看看那笼子里的男孩。

     * hasContent : 1
     */

    private int id;
    private String name;
    private int cid;
    private String cname;
    private int pid;
    private int nid;
    private String content;
    private int hasContent;

    public int getId() {
        return id;
    }

    public void setId(int id) {
        this.id = id;
    }

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

    public int getCid() {
        return cid;
    }

    public void setCid(int cid) {
        this.cid = cid;
    }

    public String getCname() {
        return cname;
    }

    public void setCname(String cname) {
        this.cname = cname;
    }

    public int getPid() {
        return pid;
    }

    public void setPid(int pid) {
        this.pid = pid;
    }

    public int getNid() {
        return nid;
    }

    public void setNid(int nid) {
        this.nid = nid;
    }

    public String getContent() {
        return content;
    }

    public void setContent(String content) {
        this.content = content;
    }

    public int getHasContent() {
        return hasContent;
    }

    public void setHasContent(int hasContent) {
        this.hasContent = hasContent;
    }
}
